      ******************************************************************
      * Author: Gabriel
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "Ola alunos eu sou o COBOL".
           STOP RUN.
       END PROGRAM PROG1.
